import { Link } from "react-router-dom";

export default function SurahItem({ surahs }) {
    const arabicSurahNames = [
        "الفَاتِحَة", "البَقَرَة", "آل عِمرَان", "النِّسَاء", "المَائدة", "الأنعَام", "الأعرَاف", "الأنفَال",
        "التوبَة", "يُونس", "هُود", "يُوسُف", "الرَّعْد", "إبراهِيم", "الحِجْر", "النَّحْل",
        "الإسْرَاء", "الكَهْف", "مَريَم", "طه", "الأنبيَاء", "الحَجّ", "المُؤمنُون", "النُّور",
        "الفُرقَان", "الشُّعَرَاء", "النَّمْل", "القَصَص", "العَنكبُوت", "الرُّوم", "لقمَان", "السَّجدَة",
        "الأحزَاب", "سَبَأ", "فَاطِر", "يس", "الصَّافات", "ص", "الزُّمَر", "غَافِر",
        "فُصِّلَت", "الشُّورى", "الزُّخْرُف", "الدُّخان", "الجَاثية", "الأحْقاف", "مُحَمّد", "الفَتْح",
        "الحُجُرَات", "ق", "الذَّاريَات", "الطُّور", "النَّجْم", "القَمَر", "الرَّحمن", "الوَاقِعَة",
        "الحَديد", "المُجادلة", "الحَشر", "المُمتَحنَة", "الصَّف", "الجُمُعَة", "المُنافِقُون", "التَّغابُن",
        "الطَّلاق", "التَّحريم", "المُلك", "القَلَم", "الحَاقَّة", "المَعارج", "نُوح", "الجِنّ",
        "المُزَّمِّل", "المُدَّثِّر", "القِيامَة", "الإنسان", "المُرسَلات", "النَّبَأ", "النّازعَات", "عَبَس",
        "التَّكوير", "الانفِطار", "المُطَفِّفِين", "الانشِقَاق", "البُرُوج", "الطَّارِق", "الأعلى", "الغَاشِية",
        "الفَجْر", "البَلَد", "الشَّمْس", "اللَّيل", "الضُّحى", "الشَّرْح", "التِّين", "العَلَق",
        "القَدْر", "البَيِّنَة", "الزَّلزَلة", "العَادِيات", "القَارِعة", "التَّكاثُر", "العَصْر", "الهُمَزَة",
        "الفِيل", "قُرَيْش", "المَاعُون", "الكَوْثَر", "الكَافِرُون", "النَّصر", "المَسَد", "الإخْلاص",
        "الفَلَق", "النَّاس"
    ];

    return (
        <Link to={`/surah/${surahs.number}`} className="font-semibold w-full hover:bg-primary/40 p-3 rounded-md border shadow flex justify-between items-start xs:col-span-12 sm:col-span-6 lg:col-span-4 group">
            <div className="flex gap-5">
                <div className="h-10 w-10 bg-primary/10 items-center flex justify-center transform rotate-45 border rounded-md group-hover:bg-primary">
                    <p className="transform rotate-[-45deg]">{surahs.number}</p>
                </div>
                <div className="flex flex-col">
                    <p>{surahs.name}</p>
                    <p>{surahs.translation}</p>
                </div>
            </div>
            <div className="text-end">
                <p className="text-lg">{arabicSurahNames[surahs.number - 1]}</p>
                <p className="text-xs">{surahs.numberOfAyahs} Ayat</p>
            </div>
        </Link>
    );
}